package lesson6;

/**
 * Создать массив типа double с размером 4.
 * Записать в него любые значения с помощью блока для инициализации. Вывести на консоль значение первого элемента.
 */
public class ArrayTwo {
    public static void main(String[] args) {
        double[] array1 = {15.12, 56.540, 87.78, 54.12};
        System.out.println(array1[0]);
    }
}
